%CLASSREGTREE_FUXIN  •ª—Þ‚Ü‚½‚Í‰ñ‹A–ØƒIƒuƒWƒFƒNƒg‚Ì?ì?¬
%
%   T = CLASSREGTREE_FUXIN(X,Y) ‚Í?A—\‘ªŽq X ‚ÌŠÖ?”‚Æ‚µ‚Ä‰ž“š Y ‚ð—\‘ª‚·‚é‚½‚ß‚É
%   Œˆ’è–Ø T ‚ð?ì?¬‚µ‚Ü‚·?BX ‚Í?A—\‘ª’l‚Ì N ?s M —ñ‚Ì?s—ñ‚Å‚·?BY ‚ª’·‚³ N ‚Ì
%   ‰ž“š’l‚ÌƒxƒNƒgƒ‹‚Ì?ê?‡?ACLASSREGTREE ‚Í‰ñ‹A‚ðŽÀ?s‚µ‚Ü‚·?BY ‚ªƒJƒeƒSƒŠ•Ï?”?A
%   •¶Žš”z—ñ?A‚Ü‚½‚Í?A•¶Žš—ñ‚ÌƒZƒ‹”z—ñ‚Ì?ê?‡?ACLASSREGTREE ‚Í•ª—Þ‚ðŽÀ?s‚µ‚Ü‚·?B
%   ‚Ç‚¿‚ç‚Ì?ê?‡‚Å‚à?AT ‚Í?A‚»‚ê‚¼‚ê‚Ì?I’[‚Å‚È‚¢ƒm?[ƒh‚ð X ‚Ì—ñ‚Ì’l‚ÉŠî‚Ã‚¢‚Ä
%   •ª—£‚·‚é“ñ•ª–Ø‚Å‚·?BX ‚Ü‚½‚Í Y “à‚Ì NaN ’l‚Í?AŒ‡‘¹’l‚Æ‚È‚é‚æ‚¤‚É—^‚¦‚ç‚ê?A
%   Œ‡‘¹’l‚ðŽ?‚ÂŠÏ‘ª‚Í?A‹ßŽ—‚ÅŽg—p‚³‚ê‚Ü‚¹‚ñ?B
%
%   T = CLASSREGTREE(X,Y,'PARAM1',val1,'PARAM2',val2,...) ‚Í?AƒIƒvƒVƒ‡ƒ“
%   ƒpƒ‰ƒ??[ƒ^‚Ì–¼‘O‚Æ’l‚Ì‘g‚Ý?‡‚í‚¹‚ðŽw’è‚µ‚Ü‚·?B:
%
%   ‚·‚×‚Ä‚ÌƒcƒŠ?[‚É‘Î‚·‚éƒIƒvƒVƒ‡ƒ“:
%      'categorical' ƒJƒeƒSƒŠ•Ï?”‚ð•À‚×‘Ö‚¦‚È‚¢‚æ‚¤‚Éˆµ‚¤‚½‚ß‚Ì X ‚Ì—ñ‚Ì
%                   ƒCƒ“ƒfƒbƒNƒXƒxƒNƒgƒ‹?B
%      'method'     'regression' (Y ‚ª?”’l‚Ì?ê?‡‚ÌƒfƒtƒHƒ‹ƒg) ‚Ü‚½‚Í 
%                   'classification' (Y ‚ª?”’l‚Å‚È‚¢?ê?‡‚ÌƒfƒtƒHƒ‹ƒg) ‚Ì‚¢‚¸‚ê‚©?B
%      'names'      —\‘ª•Ï?”‚É‘Î‚·‚é–¼‘O‚ÌƒZƒ‹”z—ñ (?ì?¬‚³‚ê‚½ƒcƒŠ?[‚©‚ç X ‚Ì
%                   ?s—ñ‚Ì?‡)?B
%      'prune'      Š®‘S‚ÈƒcƒŠ?[‚ÆŽæ‚è?œ‚©‚ê‚½ƒTƒuƒcƒŠ?[‚Ì?Å“K‚È—ñ‚ðŒvŽZ‚·‚é
%                   ?ê?‡‚Í 'on' (ƒfƒtƒHƒ‹ƒg)?A‚Ü‚½‚Í?AŽæ‚è?œ‚©‚¸‚ÉŠ®‘S‚ÈƒcƒŠ?[‚ð
%                   ŒvŽZ‚·‚é?ê?‡‚Í 'off'
%      'minparent'  •sŠ®‘S‚Èƒm?[ƒh‚ª K?A‚Ü‚½‚Í?A•ª—£‚·‚é‚½‚ß‚Ì•¡?”‚ÌŠÏ‘ª‚ð
%                   Ž?‚½‚È‚¯‚ê‚Î‚È‚ç‚È‚¢‚æ‚¤‚È?” K (ƒfƒtƒHƒ‹ƒg 10)
%      'minleaf'    ƒcƒŠ?[‚ÌƒŠ?[ƒt‚²‚Æ‚Ì?Å?¬ŠÏ‘ª?” (ƒfƒtƒHƒ‹ƒg‚Í 1)?B
%                   'minparent' ‚Æ 'minleaf' ‚Ì—¼•û‚ª—^‚¦‚ç‚ê‚½?ê?‡?A
%                   ŽŸ‚Ì‚æ‚¤‚É?A?Å‘å‚ÌƒŠ?[ƒt‚Æ‚È‚é?Ý’è‚ªŽg‚í‚ê‚Ü‚·?B
%                   MINPARENT = MAX(MINPARENT,2*MINLEAF)
%      'nvartosample' •ª—£‚²‚Æ‚É–³?ìˆ×‚É‘I‘ð‚³‚ê‚½—\‘ª•Ï?”‚Ì?”?B
%                   ƒfƒtƒHƒ‹ƒg‚Å‚Í?A‚·‚×‚Ä‚Ì•Ï?”‚ÍŒˆ’è•ª—£‚²‚Æ‚É?l—¶‚³‚ê‚Ü‚·?B
%      'mergeleaves' “¯‚¶?eƒm?[ƒh‚©‚ç?¶‚¶‚éƒŠ?[ƒt‚ðƒ}?[ƒW‚µ?A?eƒm?[ƒh‚ÉŠÖ˜A
%                   ‚·‚éƒŠƒXƒNˆÈ?ã‚ÌƒŠƒXƒN’l‚Ì˜a‚ð—^‚¦‚é?ê?‡‚Í 'on' (ƒfƒtƒHƒ‹ƒg)?B
%                   'off' ‚Ì?ê?‡?AƒŠ?[ƒt‚Íƒ}?[ƒW‚³‚ê‚Ü‚¹‚ñ?B
%
%   ‰ñ‹A–Ø‚Ì‚Ý‚ÌƒIƒvƒVƒ‡ƒ“:
%      'qetoler'     ‰ñ‹A–Ø‚Ì?ê?‡‚Éƒm?[ƒh‚²‚Æ‚Ì“ñŽŸŒë?·‚Ì‹–—eŒë?·‚ð’è‹`?B
%                    ƒm?[ƒh‚²‚Æ‚Ì“ñŽŸŒë?·‚ª QETOLER*QED ‚æ‚è?¬‚³‚­‚È‚é‚Æ?A
%                    ƒm?[ƒh‚Ì•ª—£‚ª’âŽ~‚µ‚Ü‚·?B‚±‚±‚Å?AQED ‚ÍŒˆ’è–Ø‚ª‘å‚«‚­
%                    ‚È‚é‘O‚É?A“ü—Í”z—ñ Y ‚Ì•½‹Ï‚Æ‚µ‚Ä?„’è‚³‚ê‚½ YBAR ‚ðŽ?‚Â 
%                    QED = NORM(Y-YBAR) ‚Æ‚µ‚ÄŒvŽZ‚µ‚½‘Sƒf?[ƒ^‚É‘Î‚·‚é
%                    “ñŽŸŒë?·‚Å‚·?BƒfƒtƒHƒ‹ƒg‚Í 1e-6 ‚Å‚·?B
%
%   •ª—Þ–Ø‚Ì‚Ý‚ÌƒIƒvƒVƒ‡ƒ“:
%      'cost'        ?³•û?s—ñ C?B‚±‚±‚Å?AC(i,j) ‚Í true ‚ÌƒNƒ‰ƒX‚ª i ‚Ì?ê?‡‚É
%                    ƒNƒ‰ƒX j ‚É•ª—Þ‚·‚é“_‚ÌƒRƒXƒg‚Å‚· (ƒfƒtƒHƒ‹ƒg‚Å?Ai~=j ‚Ì
%                    ?ê?‡‚Í C(i,j)=1?Ai=j ‚Ì?ê?‡‚Í C(i,j)=0 ‚Å‚·)?B‚ ‚é‚¢‚Í?A
%                    ‚±‚Ì’l‚ÍŽŸ‚Ì2 ‚Â‚ÌƒtƒB?[ƒ‹ƒh‚ðŽ?‚Â?\‘¢‘Ì S ‚É‚·‚é‚±‚Æ‚ª‚Å‚«‚Ü‚·?B
%                    ƒJƒeƒSƒŠ•Ï?”?A•¶Žš”z—ñ?A‚Ü‚½‚Í?A•¶Žš—ñ‚ÌƒZƒ‹”z—ñ‚Æ‚µ‚Ä
%                    ƒOƒ‹?[ƒv–¼‚ðŠÜ‚Þ S.group?AƒRƒXƒg?s—ñ C ‚ðŠÜ‚Þ S.cost?B
%      'splitcriterion'  •ª—£‚ð‘I‘ð‚·‚é‚½‚ß‚ÌŠî?€?BƒWƒj‚Ì‘½—l?«Žw•W‚É‘Î‚µ‚Ä 
%                    'gdi' (ƒfƒtƒHƒ‹ƒg)?Atwoing rule ‚É‘Î‚µ‚Ä 'twoing'?A
%                    ?Å‘å‚ÌˆÙ?íŒ¸?­‚É‘Î‚µ‚Ä 'deviance' ‚Ì‚¢‚¸‚ê‚©?B
%      'priorprob'   ƒxƒNƒgƒ‹ (ˆÙ‚È‚éƒOƒ‹?[ƒv–¼‚²‚Æ‚É 1 ‚Â‚Ì’l) ‚Æ‚µ‚Ä?A
%                    ‚Ü‚½‚Í?AŽŸ‚Ì 2 ‚Â‚ÌƒtƒB?[ƒ‹ƒh‚ðŽ?‚Â?\‘¢‘Ì S ‚Æ‚µ‚ÄŽw’è‚³‚ê‚é
%                    ƒNƒ‰ƒX‚²‚Æ‚Ì‘O‚ÌŠm—¦?BƒJƒeƒSƒŠ•Ï?”?A•¶Žš”z—ñ?A‚Ü‚½‚Í?A
%                    •¶Žš—ñ‚ÌƒZƒ‹”z—ñ‚Æ‚µ‚ÄƒOƒ‹?[ƒv–¼‚ðŠÜ‚Þ S.group?A‘Î‰ž‚·‚é
%                    Šm—¦‚ÌƒxƒNƒgƒ‹‚ðŠÜ‚Þ S.cost?B
%
%   —á:  ƒtƒBƒbƒVƒƒ?[‚ÌƒAƒCƒŠƒXƒf?[ƒ^‚É‘Î‚·‚é•ª—Þ–Ø‚ð?ì?¬‚µ‚Ü‚·?B
%      load fisheriris;
%      t = classregtree(meas, species,'names',{'SL' 'SW' 'PL' 'PW'});
%      view(t);
%
%   ŽQ?l CLASSREGTREE/EVAL, CLASSREGTREE/TEST, CLASSREGTREE/VIEW, 
%        CLASSREGTREE/PRUNE.


%   Copyright 2006-2009 The MathWorks, Inc. 
